package ru.instamart.autotests.tests;

public class Order_Promocodes extends TestBase {

    // Тесты заказов с промокодами
        // + проверка в админке что в заказе есть промик
        // + проверка что в заказе есть скидка/бесплатная доставка

    // TODO Заказ c промокодом на бесплатную доставку (unicorn)

    // TODO Заказ c промокодом на фикс. скидку

    // TODO Заказ c промокодом на процентную скидку

    // TODO Заказ c промокодом на процентную скидку с лимитом по сумме (проверить что лимит отрабатывает, нельзя превысить)

    // TODO Негативный кейс на применение промика на первый заказ старым юзером

    // TODO Негативный кейс на применение своего собственного реферального промика

    // TODO Позитивные и негативные кейсы на каждое правило промиков (на магазин, категорию, товар)

}
