package ru.instamart.kraken.data.hr_ops_partners.faq;

import java.util.List;

public class Faq {

    public static List<FaqData> getFaq() {
        return List.of(
                new FaqData("Что такое СберМаркет", "СберМаркет — это сервис экспресс-доставки продуктов и товаров. " +
                        "Наша миссия — экономить время, энергию и деньги людей для чего-то более важного"),
                new FaqData("Что мне понадобится", "1. Самозанятость\n" +
                        "Её можно оформить в приложении или на сайте «Мой налог». Вся процедура пройдет онлайн и займёт несколько минут, " +
                        "а выплаты будут приходить на карту каждую неделю\n" +
                        "2. Медицинская книжка (ЛМК)\n" +
                        "Если у вас ещё нет медкнижки — подскажем, где её сделать\n" +
                        "3. Вакцина против COVID-19\n" +
                        "Для выхода на пробную смену вам понадобится сертификат о вакцинации"),
                new FaqData("Кто такие самозанятые", "Согласно закону, самозанятый — это человек, который платит специальный налог на профессиональный доход (НПД)\n" +
                        "При этом не нужно дополнительно отчислять подоходный налог или налог на прибыль. " +
                        "Получить статус самозанятого могут физические лица (граждане России и других государств ЕАЭС), " +
                        "а также индивидуальные предприниматели, не имеющие наёмных работников по трудовому договору"),
                new FaqData("Как получить статус самозанятого*", "Пройдите регистрацию одним из трёх способов:\n" +
                        "1. Через сервис «Мой налог»\n" +
                        "Перейдите на сайт npd.nalog.ru или скачайте приложение. Для регистрации понадобится паспорт.\n" +
                        "2. Через личный кабинет самозанятого на сайте ФНС\n" +
                        "Перейдите на сайт lknpd.nalog.ru. Понадобится ИНН и пароль, который выдают в отделении налоговой. " +
                        "Также доступна авторизация с помощью учетной записи портала Госуслуг.\n" +
                        "3. Через мобильное приложение банка\n" +
                        "В личном кабинете есть раздел для самозанятых. Регистрация занимает несколько минут.\n" +
                        "Больше информации на npd.nalog.ru/faq/"),
                new FaqData("Можно ли выбрать магазин", "Конечно. Вы сможете выбрать адрес поближе к дому или в любом удобном районе"),
                new FaqData("Можно ли составить свой график", "Да, можно будет выбрать удобные дни и время смен")
        );
    }
}
